{
  "posts": {
    "en": [
      {
        "id": 1,
        "title": "Sprout Loves Saving - Five Reasons For You To Start to Save",
        "description": "<p>Posted on June 2nd, 2020</p><p>Did you know that on average every Mexican saves 22% of their income and that according to an old German saying it was considered a matter of personal safety to always have 100,000 Deutsche marks (now 50,000 euros) of liquid assets on your bank account.</p>",
        "content": "<p>Posted on June 2nd, 2020</p><p>Did you know that on average every Mexican saves 22% of their income and that according to an old German saying it was considered a matter of personal safety to always have 100,000 Deutsche marks (now 50,000 euros) of liquid assets on your bank account. </p><p>We here at Sprout believe that saving is a matter of education and the reason why most people do not save is due to the school system that has not been devised for helping people to control their finances. If you haven’t saved before – don’t worry – it is never too late to start saving! Sprout can help you with this.</p><p>In this blog text we list five reasons why you should save:</p><ol><li><b>It brings you peace of mind</b><br>Research shows that having savings gives you peace of mind. Financial stress can be a harmful force for your life and health. Having emergency savings is important, so if your washing machine breaks down or maybe your brother needs some emergency loan from you. Having savings even helps if you need to go through a couple of rough months due to COVID-19 or breaking up with your partner. During those times your savings account can be one of your best friends! </li><br><li><b>Being able to grab opportunities</b><br>If you save and you happen to find your dream house on sale – you can grab these opportunities. Having savings opens multiple opportunities. Or what if you become fed-up with your boss and want to quit – no worries! If you have saved money – you can try your luck as a freelancer.</li><br><li><b>Achieving your dreams with planning</b><br>In its essence, saving is about achieving your wildest dreams. If you have always wanted to buy a house, car, or vacation trip to Japan – saving money for such a dream can be extremely fulfilling. Saving money can also be fun – and reaching your savings goals can be incredibly fulfilling! This is especially true as buying a trip on a credit card would limit your ability to do future trips or achieve your other goals, because of the interest the credit card company charges from you.</li><br><li><b>Saving Builds Financial Habits</b><br>Most people are not aware of their financial habits. Starting to save makes you aware of your overall financial situation and where you are spending money. Maybe you buy a bit too many of those delicious Mexican corn cakes (Pastel de Elote) and other sweets or maybe your passion is to do some retail therapy after fighting with your spouse.<br>Getting to be aware of these habits and starting to save can lead to completely new financial habits that may lead to enrichment over time. </li><br><li><b>Financial Freedom May Be Your Goal</b><br>Starting your saving habit is your first step towards financial freedom. Being able to grab opportunities, live without stress, and achieving your dream is all about the fulfillment of your financial freedom. Do you want to retire when you are 50 years – or later – you decide!</li><br></ol><p>Please subscribe to Sprout Invest – we are looking to liberate you from the banks and centuries of bad financial education! Our next blog will discuss <u>\"Why should you invest?\"</u> and the one after that \"<u>Is it good to start investing during COVID-19</u>\".</p><p> If you have some questions or if you want us to write about something do not hesitate to write below this blog post or contact us at contact@sproutinvest.io</p>"
      },
      {
        "id": 2,
        "title": "Sprout Loves Investing - Why should you invest?",
        "description": "<p>Posted on June 2nd, 2020</p><p>Investing is a method of building wealth and making your money work for you - doesn't that sound great! Investing is not only for the wealthy. Anyone can start investing and investing can be started with small amounts.</p>",
        "content": "<p>Posted on June 2nd, 2020</p><p>Investing is a method of building wealth and making your money work for you - doesn't that sound great! Investing is not only for the wealthy. Anyone can start investing and investing can be started with small amounts.</p><p>Saving and investing are important tools for anyone considering to accomplish their financial goals as well as be preparing for any unforeseeable expenses that may arise in the future.</p><p>Some of the primary reasons for investing are:</p><ol><li><b>To create wealth</b><br>Investing your money in any form, be it in Mutual funds, ETFs, stocks etc offers returns over long periods of time. The money you earn from your investments also starts earning additional returns every year and in this way you can compound your earnings over long periods of time.</li><br><li><b>To stay ahead of inflation</b><br>1000 pesos today would only be worth 964.8 pesos next year. This is because of inflation. This would mean that you lose around 3.64% of your money if you keep it in cash form. Investing allows you to stay ahead of inflation to ensure your money is maintained, otherwise you are losing money instead of gaining it.</li><br><li><b>To accomplish financial goals</b><br>Investing allows you to achieve your short term or long term financial goal. You can accomplish your long term goals such as buying a house, funding your child’s education or retire confidently as well as achieve your short term financial goals such as buying a car, save for a wedding, plan an exotic vacation etc.</li><br><li><b>To prepare for retirement</b><br>One should invest while when they are earning income in order to accumulate a retirement stash so that they can continue to live comfortably after retirement and have a sense of financial security.</li><br><li><b>To generate higher returns</b><br>Investing can help generate much higher returns than savings bank accounts which provide around 3.53% per year. Investing in the markets, for eg. in Mutual Funds or Equities can generate upwards of 15% return per year with the right portfolio. Over long periods of time the returns from the markets are usually much higher than keeping your money in savings bank accounts. In fact, an amount of just 1000 pesos invested in the IPC Mexico index in 1995, 25 years back, would have become 17,821 today, despite the recent drop in markets as a result of the COVID-19 pandemic, which corresponds to a 12.21% return per year. If the same 1000 pesos was left in savings bank deposit accounts at 3.53% per year, then in 25 years that would only become 2380 pesos.<br><br><br><p style=\"text-align:center\"><img src=\"https://i.ibb.co/5jy9P3y/ipc-mxx.png\" alt=\"IPC Mexico index - 25 years\"></p></li><br></ol><p>Please subscribe to Sprout Invest – we are looking to liberate you from the banks and centuries of bad financial education! Our next blog will discuss \"<u>Is it good to start investing during COVID-19</u>\" and we will soon be releasing our Beginners guide to investing. Please see also our previous article \"<u>Five Reasons For You To Start to Save</u>\"?</p><p>If you have some questions or if you want us to write about something do not hesitate to write below this blog post or contact us at contact@sprout.io</p>"
      }
    ],
    "es": [
      {
        "id": 1,
        "title": "En Sprout nos encanta ahorrar - Cinco Razones para que empieces a ahorrar",
        "description": "<p>Publicado el 2 de Junio de 2020</p><p>Sabías que en promedio en México cada Mexicano ahorra 22% de su sueldo? Y también que, según un antiguo refrán alemán, se consideraba una cuestión de seguridad personal tener siempre 100,000 Marcos Alemanes (50,000 euros al día de hoy) de activos líquidos en su cuenta bancaria?</p>",
        "content": "<p>Publicado el 2 de Junio de 2020</p><p>Sabías que en promedio en México cada Mexicano ahorra 22% de su sueldo? Y también que, según un antiguo refrán alemán, se consideraba una cuestión de seguridad personal tener siempre 100,000 Marcos Alemanes (50,000 euros al día de hoy) de activos líquidos en su cuenta bancaria?</p><p>En Sprout creemos que el ahorro es una cuestión de educación y la razón por la cual la mayoría de las personas no ahorra se debe al sistema educativo que no se ha diseñado (ni adecuado) para ayudar a las personas a tener control sobre sus finanzas. Si no has ahorrado o invertido antes, no te preocupes, ¡nunca es demasiado tarde para empezar! Sprout te va llevar paso a paso para que tengas mejores cimientos en tus finanzas personales.</p><p>En esta publicación del blog, te platicamos 5 razones básicas que hacen que ahorrar sea una excelente práctica:</p><ol><li><b>Te genera tranquilidad mental</b><br>Investigaciones han demostrado que tener ahorros produce tranquilidad mental. El estrés financiero puede convertirse  en un aspecto nocivo para tu vida y tu salud. Tener ahorros para emergencias es muy importante, por ejemplo, en el caso que tu coche se descomponga o tengas alguna emergencia médica. Tener ahorros ayuda también a enfrentar tiempos complicados en donde tus ingresos pueden ser menores como en muchos casos provocados por COVID-19. ¡Durante esos momentos, tu cuenta de ahorro te pueda aportar paz y tranquilidad mental.</li><br><li><b> Aprovecha mejores oportunidades</b><br>Si mantienes una cuenta de ahorro etiquetada para algo como “Ahorro para Viajes”  y al mismo tiempo encuentras una súper oferta para viajar a un país nuevo - puedes aprovechar esta oportunidad de cumplir tu sueño. También existe la posibilidad de que ya no soportas a tu jefe y quieres buscar nuevas oportunidades - no te preocupes! si cuentas con ahorros suficientes, podrías hasta abrir tu propio negocio.</li><br><li><b>Lograr tus sueños con planificación</b><br>La esencia del ahorro consiste en lograr todos tus sueños. Si tienes la mentalidad de Sprout, estarás de acuerdo que hay mucho mundo para tan poco tiempo en la vida, por lo que es momento de actuar y lograr ese viaje soñado o ese depa que siempre haz querido. Muchas personas consideran que pagar un viaje a “meses sin intereses” es la mejor opción, no obstante, siempre es mejor ahorrar y pagar tu viaje o tu coche a pagar meses sin intereses, debido a que los pagos a meses sin intereses pueden reducir tus ingresos después de ese viaje, y exponerte a otras emergencias.</li><br><li><b>El ahorro genera hábitos financieros</b><br>La mayoría de las personas no somos conscientes de nuestros hábitos financieros. Comenzar a ahorrar te hace consciente de tu situación financiera en general y de en dónde estás gastando tu dinero. Mientras mejor sea tu hábito para ahorrar, más fácil va a ser darte un gusto e irte de shopping, o invitar a cenar a tu pareja a un lugar delicioso.<br>Empezar a tener conciencia de estos hábitos y comenzar a ahorrar puede conducirte a hábitos financieros completamente nuevos que te llevarán a aumentar tu riqueza a lo largo del tiempo.</li><br><li><b>La libertad financiera puede ser tu objetivo</b><br>Iniciar con un hábito de ahorro es tu primer paso hacia la libertad financiera. Ser capaz de aprovechar oportunidades, vivir sin estrés y lograr tu sueños, son todas consecuencias de alcanzar tu libertad financiera.<br>Ser libre es no rendirle cuentas a nadie sobre lo que haces con tu dinero, ¿Quieres jubilarte a los 50?, claro que se puede con un ahorro constante y disciplinado ¡Eso es ser libre!</li><br></ol><p>Te invitamos a suscribirte a Sprout Invest - nuestra intención es empoderarte con información de calidad  para que seas libre de los intereses de tu tarjeta y de las comisiones de tu banco. En nuestro próximo blog discutiremos <u>\"¿Cuáles son las diferencias entre invertir y ahorrar?\"</u> y, a continuación \"<u>¿Por que es un buen momento para empezar a invertir durante la pandemia de COVID-19?.</u>\".</p><p> Si tienes alguna pregunta o si desea que escribamos sobre algo específico, por favor no dudes escríbenos a contact@sproutinvest.io</p>"
      },
      {
        "id": 2,
        "title": "En Sprout nos encanta invertir: ¿por qué deberías invertir?",
        "description": "<p>Publicado el 2 de Junio de 2020</p><p>Invertir es un método para generar riqueza y hacer que tu dinero trabaje para ti! no suena super atractivo? Invertir no es algo solo para los ricos. Cualquier persona puede comenzar a invertir y lo puede hacer con pequeñas cantidades de dinero.</p>",
        "content": "<p>Publicado el 2 de Junio de 2020</p><p>Invertir es un método para generar riqueza y hacer que tu dinero trabaje para ti! no suena super atractivo? Invertir no es algo solo para los ricos. Cualquier persona puede comenzar a invertir y lo puede hacer con pequeñas cantidades de dinero.</p><p>Ahorrar e invertir son herramientas importantes para cualquiera que esté considerando cumplir con sus objetivos financieros como así también estar listo para cualquier gasto imprevisible que pueda surgir en el futuro.</p><p>Algunas de las razones principales para invertir son:</p><ol><li><b>Para generar riqueza</b><br>Invertir tu dinero en cualquier forma, ya sea en fondos de inversión, acciones, bonos, etc, te brinda retornos a lo largo del tiempo. El dinero que gana de sus inversiones también comienza a generar retornos adicionales año a año y de esta manera puede aumentar aun más sus ganancias durante largos periodos de tiempo.</li><br><li><b>Para ganarle a la inflación</b><br>1,000 pesos de hoy van a valer solamente 965 pesos en un año. Esto se debe a la inflación. Esto significa tu vas a perder cerca de 4% de tu dinero si lo ahorras en efectivo. Invertir te permite ganarle a la inflación para evitar que tus ahorros pierdan valor con el tiempo.</li><br><li><b>Para alcanzar objetivos financieros</b><br>Invertir te permite alcanzar tus objetivos financieros de corto y largo plazo. Puedes lograr tus objetivos de corto plazo como comprar un coche, ahorrar para tu boda, planear unas divertidas vacaciones, etc. También sirve para alcanzar tus objetivos de largo plazo como comprar tu casa, pagar la educación de tus hijos o jubilarte con tranquilidad.</li><br><li><b>Para preparar tu jubilación</b><br>Se debe invertir mientras generas ingresos y así poder acumular una reserva jubilatoria para poder seguir viviendo cómodamente una ve que dejes de trabajar y sentir que tienes seguridad financiera.</li><br><li><b>Para generar mayores retornos</b><br>La inversión te puede ayudar a obtener retornos mucho mas altos que si solamente ahorras tu dinero en tu cuenta bancaria que te dará un retorno de ~3.5% al año. En cambio, si inviertes tu dinero en el mercado financiero por ejemplo en fondos de inversión o en acciones, podrías llegar a generar retornos del 15% anual siempre y cuando tengas una adecuada cartera de inversión. Durante largos periodos de tiempo, los rendimientos de los mercados financieros suelen ser mucho mas altos que mantener tu dinero en tu cuenta de ahorro del banco. De hecho, si tu hubieras invertido 1,000 pesos en el índice IPC de México en 1995, 25 años atrás, hoy tendrías 17,821 pesos (sin contar el efecto reciente del COVID-19), lo que corresponde a un rendimiento anual de 12.2%.<br><br><br><p style=\"text-align:center\"><img src=\"https://i.ibb.co/5jy9P3y/ipc-mxx.png\" alt=\"IPC Mexico index - 25 years\"></p></li><br></ol><p>Te invitamos a suscribirte a Sprout Invest - nuestra intención es empoderarte con información de calidad  para que seas libre de los intereses de tu tarjeta y de las comisiones de tu banco.</p><p>Si tienes alguna pregunta o si desea que escribamos sobre algo específico, por favor no dudes escríbenos a contact@sproutinvest.io</p>"
      }
    ]
  } 
}