{
  "posts": [
    {
      "id": 1,
      "title": "Sprout Loves Saving - Five Reasons For You To Start to Save",
      "description": "<p>Did you know that on average every Swedish person has 11,000 dollars in the stock market and that according to an old German saying it was considered a matter of personal safety to always have 100,000 Deutsche marks (now 50,000 euros) of liquid assets on your bank account.</p>",
      "content": "<p>Did you know that on average every Swedish person has 11,000 dollars in the stock market and that according to an old German saying it was considered a matter of personal safety to always have 100,000 Deutsche marks (now 50,000 euros) of liquid assets on your bank account.</p><p>We here at Sprout believe, that saving is a matter of education and the reason why most people do not save, is due to the school system that has not been devised for helping people to control their finances. If you haven't saved before - don't worry - it is never too late to start saving! Sprout can help you with this.</p><p>In this blog text we list five reasons why you should save:</p><ol><li><b>It brings you peace of mind</b><br>Research shows that having savings gives you peace of mind. Financial stress can be a harmful force for your life and health. Having emergency savings is important, so if your washing machine breaks down or maybe your brother needs some emergency loan from you. Having savings even helps if you need to go through a couple of rough months due to COVID-19 or breaking up with your partner. During those times your savings account can be one of your best friends! </li><br><li><b>Being able to grab opportunities</b><br>If you save and you happen to find your dream house on sale – you can grab these opportunities. Having savings opens multiple opportunities. Or what if you become fed-up with your boss and want to quit – no worries! If you have saved money – you can try your luck as a freelancer.</li><br><li><b>Achieving your dreams with planning</b><br>In its essence, saving is about achieving your wildest dreams. If you have always wanted to buy a house, car, or vacation trip to Japan – saving money for such a dream can be extremely fulfilling. Saving money can also be fun – and reaching your savings goals can be incredibly fulfilling! This is especially true as buying a trip on a credit card would limit your ability to do future trips or achieve your other goals, because of the interest the credit card company charges from you.</li><br><li><b>Savings Builds Financial Habits</b><br>Most people are not aware of their financial habits. Starting to save makes you aware of your overall financial situation and where you are spending money. Maybe you buy a bit too many of those delicious Mexican corn cakes (Pastel de Elote) and other sweets or maybe your passion is to do some retail therapy after fighting with your spouse.<br>Getting to be aware of these habits and starting to save can lead to completely new financial habits that may lead to enrichment over time. </li><br><li><b>Financial Freedom May Be Your Goal</b><br>Starting your saving habit is your first step towards financial freedom. Being able to grab opportunities, live without stress, and achieving your dream is all about the fulfillment of your financial freedom. Do you want to retire when you are 50 years – or later – you decide!</li><br></ol><p>Please subscribe to Sprout Invest – we are looking to liberate you from the banks and centuries of bad financial education! Our next blog will discuss <u>\"Why should you invest?\"</u> and the one after that \"<u>Is it good to start investing during COVID-19</u>\". If you have some questions or if you want us to write about something do not hesitate to write below this blog post or contact us at contact@sproutinvest.io</p>"
    },
    {
      "id": 2,
      "title": "Why Should You Invest?",
      "description": "<p>Investing is a method of building wealth and making your money work for you, and it’s not just for the wealthy! Anyone can start investing, and there are various products and channels to invest which make it easy to begin even with small amounts.</p>",
      "content": "<p>Investing is a method of building wealth and making your money work for you, and it’s not just for the wealthy! Anyone can start investing, and there are various products and channels to invest which make it easy to begin even with small amounts.</p><p>Saving and investing are important tools everyone must consider to accomplish your financial goals as well as be prepared for any unforeseen expenses that may arise in the future.</p><p>Here, we list some of the primary reasons to invest:</p><ol><li><b>To create wealth </b><br>Investing your money in any form, be it in Mutual funds, ETFs, stocks etc offers returns over long periods of time. The money you earn from your investments also starts earning additional returns every year and in this way you can compound your earnings over long periods of time.</li><br><li><b>To stay ahead of inflation</b><br>1000 pesos today would only be worth 964.8 pesos next year according to recent Mexican inflation data. This would mean that you lose around 3.64%  of your purchasing power every year if you keep your money as cash. Investing allows you to stay ahead of inflation to ensure your buying power is maintained, because if you do not beat inflation, then you are losing money instead of making money.</li><br><li><b>To prepare for retirement </b><br>One should invest while when they are earning income in order to accumulate a retirement corpus so that they can continue to live comfortably after retirement and have a sense of financial security.</li><br><li><b>To accomplish financial goals </b><br>Investing allows you to achieve your short term or long term financial goal. You can accomplish your long term goals such as buying a house, funding your child’s education or retire confidently as well as achieve your short term financial goals such as buying a car, save for a wedding, plan an exotic vacation etc.</li><br><li><b>To Save tax </b><br>Certain types of investments allow you to get tax exemptions and deductions which can effectively double your return as any money saved is money earned.</li><br><li><b>To generate higher returns </b><br>Investing can help generate much higher returns than savings bank accounts which provide around 3.53%  per year. Investing in the markets, for eg. in Mutual Funds or Equities can generate upwards of 15% return per year with the right portfolio. Over long periods of time the returns from the markets are usually much higher than keeping your money in savings bank accounts. In fact, an amount of just 1000 pesos invested in the IPC Mexico index in 1995, 25 years back, would have become 17,821 today, despite the recent drop in markets as a result of the COVID-19 pandemic, which corresponds to a 12.21% return every year over the last 25 years. If the same 1000 pesos was left in savings bank deposit accounts at 3.53% per year, then in 25 years that would only become 2380 pesos.<br><br><br><p style=\"text-align:center\"><img src=\"https://i.ibb.co/5jy9P3y/ipc-mxx.png\" alt=\"IPC Mexico index - 25 years\"></p></li><br></ol><p>Please subscribe to Sprout Invest to stay updated with our articles and new product features coming soon! If you have some questions or if you want us to write about something do not hesitate to write below this blog post or contact us at contact@sproutinvest.io</p>"
    }
  ]
}